| comment "Dragnet [Ransomware/IOC]: dragnet-ransomware-2025-2367 — Ransomware C2 Communication"
| comment "Status: experimental | Level: high | ID: bb8dec9a-61f4-5939-b6f8-8a2bdbd9d490"
index=* sourcetype=network*
| where (dest="*http://twniiyed6mydtbe64i5mdl56nihl7atfaqtpww6gqyaiohgc75apzpad.onion/posts/68571a16c4bd670d163436e7/68571a16c4bd670d163436e7/*")
| table _time, src, dest, dest_ip, process
| head 1000
