| comment "Dragnet [Ransomware]: dragnet-ransomware-2021-1017 — Shadow Copy Deletion (pysa)"
| comment "Status: deprecated | Level: high | ID: 672ea24c-7c3a-526b-9e24-1e86254813f2"
index=* sourcetype=endpoint*
| where 1ofselection_
| table _time, host, process, parent_process, CommandLine
| head 1000
