| comment "Dragnet [Ransomware]: dragnet-ransomware-2025-3502 — Event Log Clearing (gunra)"
| comment "Status: experimental | Level: high | ID: 77bd7635-14aa-5e8e-888a-fbe64a6526f2"
index=* sourcetype=endpoint*
| where 1ofselection_
| table _time, host, process, parent_process, CommandLine
| head 1000
