| comment "Dragnet [Ransomware]: dragnet-ransomware-2025-7354 — Shadow Copy Deletion (safepay)"
| comment "Status: experimental | Level: high | ID: e4858d08-1333-56b5-a756-68e400f5fb65"
index=* sourcetype=endpoint*
| where 1ofselection_
| table _time, host, process, parent_process, CommandLine
| head 1000
