| comment "Dragnet [Ransomware]: dragnet-ransomware-2023-1319 — Shadow Copy Deletion (vicesociety)"
| comment "Status: deprecated | Level: high | ID: ae95d40e-fbdc-510a-b453-cb739271ec93"
index=* sourcetype=endpoint*
| where 1ofselection_
| table _time, host, process, parent_process, CommandLine
| head 1000
