| comment "Dragnet [Ransomware]: dragnet-ransomware-2025-1818 — Event Log Clearing (fog)"
| comment "Status: experimental | Level: high | ID: 0c64e86d-f021-5993-9e8f-8beb21044866"
index=* sourcetype=endpoint*
| where 1ofselection_
| table _time, host, process, parent_process, CommandLine
| head 1000
