| comment "Dragnet [Ransomware]: dragnet-ransomware-2025-3224 — Recovery Inhibition (medusa)"
| comment "Status: experimental | Level: high | ID: 05505cc7-5035-58cf-b0fc-a9904a261045"
index=* sourcetype=endpoint*
| where (CommandLine="*recoveryenabled no*" OR CommandLine="*bootstatuspolicy ignoreallfailures*") AND (process="*\bcdedit.exe")
| table _time, host, process, parent_process, CommandLine
| head 1000
