| comment "Dragnet [Ransomware]: dragnet-ransomware-2025-2465 — Event Log Clearing (thegentlemen)"
| comment "Status: test | Level: high | ID: f5316b4b-ee67-54e5-824a-d6126f853947"
index=* sourcetype=endpoint*
| where 1ofselection_
| table _time, host, process, parent_process, CommandLine
| head 1000
