| comment "Dragnet [Ransomware]: dragnet-ransomware-2025-7147 — Shadow Copy Deletion (spacebears)"
| comment "Status: experimental | Level: high | ID: 85ba8d2e-e69e-5e4e-ba2d-b4e0edae167c"
index=* sourcetype=endpoint*
| where 1ofselection_
| table _time, host, process, parent_process, CommandLine
| head 1000
