| comment "Dragnet [Ransomware]: dragnet-ransomware-2026-3122 — Recovery Inhibition (incransom)"
| comment "Status: test | Level: high | ID: 4b8ffd8c-9276-5868-8593-eec7eb15c773"
index=* sourcetype=endpoint*
| where (CommandLine="*recoveryenabled no*" OR CommandLine="*bootstatuspolicy ignoreallfailures*") AND (process="*\bcdedit.exe")
| table _time, host, process, parent_process, CommandLine
| head 1000
