| comment "Dragnet [Ransomware]: dragnet-ransomware-2021-0865 — Event Log Clearing (azroteam)"
| comment "Status: deprecated | Level: high | ID: 1f52f586-9de9-5b36-9c79-6287fa101227"
index=* sourcetype=endpoint*
| where 1ofselection_
| table _time, host, process, parent_process, CommandLine
| head 1000
