| comment "Dragnet [Ransomware/IOC]: dragnet-ransomware-2024-1217 — Ransomware C2 Communication"
| comment "Status: experimental | Level: high | ID: e54f47a6-294d-513e-9ba3-54da3db094c0"
index=* sourcetype=network*
| where (dest="*http://7ixfdvqb4eaju5lzj4gg76kwlrxg4ugqpuog5oqkkmgfyn33h527oyyd.onion/sell32.html*")
| table _time, src, dest, dest_ip, process
| head 1000
