| comment "Dragnet [Ransomware]: dragnet-ransomware-2024-2209 — Recovery Inhibition (qilin)"
| comment "Status: experimental | Level: high | ID: f0edadf4-5de5-5be2-89b3-0987b5820cc8"
index=* sourcetype=endpoint*
| where (CommandLine="*recoveryenabled no*" OR CommandLine="*bootstatuspolicy ignoreallfailures*") AND (process="*\bcdedit.exe")
| table _time, host, process, parent_process, CommandLine
| head 1000
