| comment "Dragnet [Ransomware]: dragnet-ransomware-2023-4169 — Recovery Inhibition (noescape)"
| comment "Status: experimental | Level: high | ID: f191ceff-ec18-53a1-b344-2882b70924c0"
index=* sourcetype=endpoint*
| where (CommandLine="*recoveryenabled no*" OR CommandLine="*bootstatuspolicy ignoreallfailures*") AND (process="*\bcdedit.exe")
| table _time, host, process, parent_process, CommandLine
| head 1000
