| comment "Dragnet [Ransomware]: dragnet-ransomware-2026-0086 — Shadow Copy Deletion (rhysida)"
| comment "Status: deprecated | Level: high | ID: 3e2a0587-4708-58d8-8544-6ff28f37a638"
index=* sourcetype=endpoint*
| where 1ofselection_
| table _time, host, process, parent_process, CommandLine
| head 1000
