| comment "Dragnet [Ransomware/IOC]: dragnet-ransomware-2023-0739 — Ransomware C2 Communication"
| comment "Status: experimental | Level: high | ID: dddc2cae-f47f-5b74-8756-52a2b940d622"
index=* sourcetype=network*
| where (dest="*http://lockbitapt2d73krlbewgv27tquljgxr33xbwwsp6rkyieto7u4ncead.onion/post/YvrwQEiM2LpJ8adY64b4425b086bf*")
| table _time, src, dest, dest_ip, process
| head 1000
