| comment "Dragnet [Ransomware/IOC]: dragnet-ransomware-2023-3810 — Ransomware C2 Communication"
| comment "Status: experimental | Level: high | ID: 1f58e2c7-8255-5b1e-b4c9-b8b3cd2f24fc"
index=* sourcetype=network*
| where (dest="*http://lockbitapt2d73krlbewgv27tquljgxr33xbwwsp6rkyieto7u4ncead.onion/post/KzM5oHtwBJ1EIUyn64d4121dbf580*")
| table _time, src, dest, dest_ip, process
| head 1000
